app/Controllers/CarreraController.php

    public function index()
    {
        $carreraModel = new CarreraModel();
        $data['carreras'] = $carreraModel->findAll(); // Obtener todas las carreras
---
SELECT *
FROM `carreras`