app/Controllers/CursosController.php

    public function index()
    {
        $cursoModel = new CursoModel();
        $data['cursos'] = $cursoModel->findAll();
---
SELECT *
FROM `cursos`