app/Controllers/NotasController.php

    public function index()
    {
        $notaModel = new NotaModel();
        $data['notas'] = $notaModel->findAll();
---
SELECT *
FROM `notas`

    public function edit($id_nota)
    {
        $notaModel = new NotaModel();
        $data['nota'] = $notaModel->find($id_nota);
---
SELECT *
FROM `notas`
WHERE `notas`.`id_nota` = '1'